# AssetPropertyDistance Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDistance Class
Members See Also
---
Represents a property of material.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetPropertyDistance : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyDistance _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyDistance : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyDistance
# See Also
AssetPropertyDistance Members
Autodesk.Revit.DB.Visual Namespace